app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `rooms`
SELECT COUNT(*) AS `numrows`
FROM `rooms`
WHERE `status` = 'occupied'
SELECT SUM(`total_price`) AS `total_price`
FROM `reservations`
WHERE DATE(check_in_date) = '2026-09-23'
AND `status` != 'cancelled'
---
    public function index()
    {
        // Cek login
        if (! auth()->loggedIn()) {
            return redirect()->to('/login');
        }

        $roomModel = new RoomModel();

        // Statistik Kamar
        $totalRooms    = $roomModel->countAllResults();
        $occupiedRooms = $roomModel->where('status', 'occupied')->countAllResults();

        // Hitung okupansi (%)
        $occupancyRate = $totalRooms > 0
            ? round(($occupiedRooms / $totalRooms) * 100)
            : 0;

      // Pendapatan hari ini — dihitung dari reservasi yang check-in hari ini
$db = \Config\Database::connect();
$todayRevenue = 0;
try {
    $row = $db->table('reservations')
        ->selectSum('total_price')
        ->where('DATE(check_in_date)', date('Y-m-d'))
        ->where('status !=', 'cancelled')
        ->get()
        ->getRow();

SELECT COUNT(*) AS `numrows`
FROM `rooms`
WHERE `status` = 'vacant_dirty'
SELECT COUNT(*) AS `numrows`
FROM `rooms`
WHERE `status` = 'out_of_order'
---
        $roomStatus = [
            'vacant_clean'  => $roomModel->where('status', 'vacant_clean')->countAllResults(),
            'occupied'      => $occupiedRooms,
            'vacant_dirty'  => $roomModel->where('status', 'vacant_dirty')->countAllResults(),
            'out_of_order'  => $roomModel->where('status', 'out_of_order')->countAllResults(),