app/Controllers/Report.php

SELECT SUM(`total_price`) AS `total_price`
FROM `reservations`
WHERE `check_in_date` >= '2026-08-25'
AND `check_in_date` <= '2026-09-23'
AND `status` != 'cancelled'
SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `check_in_date` >= '2026-08-25'
AND `check_in_date` <= '2026-09-23'
AND `status` != 'cancelled'
SELECT COUNT(*) AS `numrows`
FROM `rooms`
SELECT COUNT(*) AS `numrows`
FROM `rooms`
WHERE `status` = 'occupied'
---
    public function data()
    {
        $period = $this->request->getGet('period') ?? '30days';
        $db     = \Config\Database::connect();

        // Tentukan rentang tanggal
        [$startDate, $endDate] = $this->getDateRange($period);

        // ============ 1. RINGKASAN UMUM ============
        $totalRevenue = $db->table('reservations')
            ->selectSum('total_price')
            ->where('check_in_date >=', $startDate)
            ->where('check_in_date <=', $endDate)
            ->where('status !=', 'cancelled')
            ->get()->getRow()->total_price ?? 0;

        $totalReservations = $db->table('reservations')
            ->where('check_in_date >=', $startDate)
            ->where('check_in_date <=', $endDate)
            ->where('status !=', 'cancelled')
            ->countAllResults();

      $totalRooms    = $db->table('rooms')->countAllResults();
$occupiedRooms = $db->table('rooms')->where('status', 'occupied')->countAllResults();

SELECT SUM(`quantity_approved`) AS `quantity_approved`
FROM `sr_details`
WHERE `sr_id` IN (SELECT `id` FROM `store_requisitions` WHERE `status` = 'delivered' AND `requested_date` >= '2026-08-25' AND `requested_date` <= '2026-09-23')
---
$occupancyRate = $totalRoomNightsAvail > 0
    ? round(($totalRoomNightsUsed / $totalRoomNightsAvail) * 100, 1)
    : 0;
        $totalItems = $db->table('sr_details')
            ->selectSum('quantity_approved')
            ->whereIn('sr_id', function ($builder) use ($startDate, $endDate) {
                $builder->select('id')->from('store_requisitions')
                    ->where('status', 'delivered')
                    ->where('requested_date >=', $startDate)
                    ->where('requested_date <=', $endDate);
            })
            ->get()->getRow()->quantity_approved ?? 0;