app/Controllers/Room.php

SELECT `rooms`.*, `room_types`.`name` AS `type_name`
FROM `rooms`
LEFT JOIN `room_types` ON `room_types`.`id` = `rooms`.`room_type_id`
ORDER BY `rooms`.`floor` ASC, `rooms`.`room_number` ASC
SELECT *
FROM `room_types`
ORDER BY `name` ASC
---
    public function index()
    {
        $data = [
            'title'     => 'Kamar - Sistem Hotel',
            'rooms'     => $this->model
                ->select('rooms.*, room_types.name AS type_name')
                ->join('room_types', 'room_types.id = rooms.room_type_id', 'left')
                ->orderBy('rooms.floor', 'ASC')
                ->orderBy('rooms.room_number', 'ASC')
                ->findAll(),
            'roomTypes' => $this->roomTypeModel->orderBy('name', 'ASC')->findAll(),