app/Controllers/RoomType.php

    public function index()
    {
        $data = [
            'title'     => 'Tipe Kamar - Sistem Hotel',
            'roomTypes' => $this->model->orderBy('name', 'ASC')->findAll(),
---
SELECT *
FROM `room_types`
ORDER BY `name` ASC