app/Controllers/RoomMap.php

SELECT `rooms`.*, `room_types`.`name` AS `type_name`, `room_types`.`base_price`
FROM `rooms`
LEFT JOIN `room_types` ON `room_types`.`id` = `rooms`.`room_type_id`
ORDER BY `rooms`.`floor` ASC, `rooms`.`room_number` ASC
---
    public function data()
    {
        $rooms = $this->model
            ->select('rooms.*, room_types.name AS type_name, room_types.base_price')
            ->join('room_types', 'room_types.id = rooms.room_type_id', 'left')
            ->orderBy('rooms.floor', 'ASC')
            ->orderBy('rooms.room_number', 'ASC')
            ->findAll();

UPDATE `rooms` SET `status` = 'vacant_clean', `updated_at` = '2026-09-23 03:54:15'
WHERE `rooms`.`id` IN ('1')
---
    public function updateStatus($id = null)
    {
        $room = $this->model->find($id);

        if (! $room) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Kamar tidak ditemukan.',
            ])->setStatusCode(404);
        }

        $newStatus = $this->request->getPost('status');
        $allowed = ['vacant_clean', 'vacant_dirty', 'occupied', 'on_change', 'out_of_order', 'out_of_service'];

        if (! in_array($newStatus, $allowed)) {
            return $this->response->setJSON([
                'success' => false,
                'message' => 'Status tidak valid.',
            ])->setStatusCode(400);
        }

        $this->model->update($id, ['status' => $newStatus]);