app/Controllers/Settings.php

    public function index()
    {
        $db = \Config\Database::connect();

        // Ambil users beserta role mereka
        $users = $db->table('users u')
            ->select('u.*, GROUP_CONCAT(g.`group` SEPARATOR ", ") AS role_names')
            ->join('auth_groups_users g', 'g.user_id = u.id', 'left')
            ->groupBy('u.id')
            ->orderBy('u.username', 'ASC')
            ->get()->getResultArray();
---
SELECT `u`.*, GROUP_CONCAT(g.`group` SEPARATOR ", ") AS role_names
FROM `users` `u`
LEFT JOIN `auth_groups_users` `g` ON `g`.`user_id` = `u`.`id`
GROUP BY `u`.`id`
ORDER BY `u`.`username` ASC