app/Models/AppSettingModel.php

    public function getAllKeyed(): array
    {
        $rows = $this->findAll();
---
SELECT *
FROM `app_settings`